AccumulationRegisters/РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОплате</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплачивается</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отгружается</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуКлиенту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродажаПоЗаказу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Comment>Заполняется для реализации товаров и услуг</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключатьПриКонтроле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимаяСуммаЗадолженности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалогЗаТару</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗачетаПоДатеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляОплатыКлиентом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетовПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерамПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриемник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДаннымОбъектаРасчетовИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОперацийВзаимозачетаЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВзаимозачетаЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалитьКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМеждуКлиентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМеждуПоставщиками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКлиентаМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоставщикаМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносАвансаКлиентаОрганизацияКонтрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносАвансаКлиентаМеждуКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносАвансаКлиентаМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносАвансаПоставщикуОрганизацияКонтрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносАвансаПоставщикуМеждуКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносАвансаПоставщикуМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДолгаКлиентаОрганизацияКонтрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДолгаКлиентаМеждуКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДолгаКлиентаМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДолгаПоставщикуОрганизацияКонтрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДолгаПоставщикуМеждуКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДолгаПоставщикуМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПодарочнымСертификатом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеОплатыЧерезКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтражениеВозвратаОплатыЧерезКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносАвансаКлиентаМеждуДвумяОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДолгаКлиентаМеждуДвумяОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносАвансаПоставщикуМеждуДвумяОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДолгаПоставщикуМеждуДвумяОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БартерМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВнешниеПользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВнешниеПользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАвторизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВнешнийПользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьРолиНепосредственно</Name>
					<Comment>Используется, если не встроена подсистема "Управление доступом"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/РасчетыСКлиентами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Т1 
	|	ПО Т.АналитикаУчетаПоПартнерам = Т1.КлючАналитики
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т1.Организация)
	|	И ЗначениеРазрешено(Т1.Партнер)";
	
	Ограничение.ТекстДляВнешнихПользователей =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|	ПО АналитикаУчетаПоПартнерам.КлючАналитики = ЭтотСписок.АналитикаУчетаПоПартнерам
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПользователи КАК ВнешниеПользователиПартнеры
	|	ПО ВнешниеПользователиПартнеры.ОбъектАвторизации = АналитикаУчетаПоПартнерам.Партнер
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ВнешниеПользователиПартнеры.Ссылка)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КонтрольИтогов

// Есть изменения итогов набора.
// 
// Параметры:
//  Набор - РегистрНакопленияНаборЗаписей.РасчетыСКлиентами,
//          РегистрНакопленияНаборЗаписей.РасчетыСПоставщиками,
//          РегистрНакопленияНаборЗаписей.РасчетыСПоставщикамиПоСрокам,
//          РегистрНакопленияНаборЗаписей.РасчетыСКлиентамиПоСрокам .
//  ДвиженияДоИзменения - ТаблицаЗначений - Движения до изменения.
// 
// Возвращаемое значение:
//  Булево - Есть изменения итогов набора
Функция ЕстьИзмененияИтоговНабора(Набор, ДвиженияДоИзменения) Экспорт
	
	Если НЕ Набор.Модифицированность() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИменаИзмерений = "АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта";
	Если ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСКлиентами")
		ИЛИ ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСПоставщиками") Тогда
		ИменаРесурсов = "Сумма";
	ИначеЕсли ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСКлиентамиПоСрокам")
		ИЛИ ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСПоставщикамиПоСрокам") Тогда
		ИменаРесурсов = "Предоплата,Долг";
	Иначе
		ТекстОшибки = НСтр("ru = 'Не удалось определить ресурсы для сравнения итогов набора записей.'");
		ВызватьИсключение(ТекстОшибки, КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	ПроблемныйРегистратор = Набор.Отбор.Регистратор.Значение;
	
	ВсеКолонки = ИменаИзмерений+","+ИменаРесурсов;
	Ресурсы = СтрРазделить(ИменаРесурсов,",");
	
	// Добавим итоги нового набора в таблицу сравнения.
	СравнениеИтогов = Набор.Выгрузить();
	Для Каждого Запись Из СравнениеИтогов Цикл
		Если Запись.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
			ИнвертироватьЗнак(Запись, Ресурсы);
		КонецЕсли;
	КонецЦикла;
	СравнениеИтогов.Свернуть(ИменаИзмерений,ИменаРесурсов);
	
	// Рассчитаем итоги набора до изменения.
	ИтогиДоИзменения = ДвиженияДоИзменения.СкопироватьКолонки(ВсеКолонки);
	Для Каждого Запись Из ДвиженияДоИзменения Цикл
		НовыйИтог = ИтогиДоИзменения.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйИтог,Запись,ВсеКолонки);
		Если Запись.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
			ИнвертироватьЗнак(НовыйИтог, Ресурсы);
		КонецЕсли;
	КонецЦикла;
	ИтогиДоИзменения.Свернуть(ИменаИзмерений,ИменаРесурсов);
	
	// Добавим итоги до изменения в таблицу сравнения.
	Для Каждого Запись Из ИтогиДоИзменения Цикл
		НовыйИтог = СравнениеИтогов.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйИтог,Запись,ВсеКолонки);
		ИнвертироватьЗнак(НовыйИтог, Ресурсы);
	КонецЦикла;
	СравнениеИтогов.Свернуть(ИменаИзмерений,ИменаРесурсов);
	
	// Если после группировки в таблице сравнения итогов количество строк с нулевыми ресурами
	// не равно количеству строк таблицы итогов до изменения, то итоги изменились
	Отбор = Новый Структура();
	Для Каждого Ресурс Из Ресурсы Цикл
		Отбор.Вставить(Ресурс,0);
	КонецЦикла;
	НайденныеСтроки = СравнениеИтогов.НайтиСтроки(Отбор);
	ЕстьИзменения = НайденныеСтроки.Количество() <> ИтогиДоИзменения.Количество();
	
	Если ЕстьИзменения Тогда
		ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(
			ПроблемныйРегистратор,
			НСтр("ru = 'После обновления изменились итоги ресурсов в движениях документа.
			|Обновление документа отменено.'"));
	КонецЕсли;
	
	Возврат ЕстьИзменения;
	
КонецФункции

Процедура ИнвертироватьЗнак(Запись, Ресурсы)
	
	Для Каждого Ресурс Из Ресурсы Цикл
		Запись[Ресурс] = -Запись[Ресурс];
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.РасчетыСКлиентами.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.20.49";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("489f7d26-6bd5-7943-a55c-3d06d445974a");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.РасчетыСКлиентами.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	Обработчик.Комментарий = СтрШаблон(НСтр("ru = 'Очищает движения ресурса ""Оплачивается"" по Заявкам на расходование средств с пустыми объектами расчетов.
	|Исправляет порядок операции движений по ресурсу ""%1""
	|Перезаполняет поле ""Порядок зачета по дате платежа"" для платежных документов.
	|Сбрасывает реквизит ""По данным объекта расчетов источника"" в случае если в движениях документа не заполнены реквизиты приемника.
	|Исправляет остаток ресурса ""%2"" при расчетах с детализациями ""Аванс по заказам, долг по накладным"", ""Аванс по договорам, долг по накладным"".
	|Исправляет хозяйственную операцию для движения документов ""Взаимозачет задолженности"".
	|Заполняет реквизит ""По данным объекта расчетов источника"" в расчетах по срокам.'"), 
	Метаданные.РегистрыНакопления.РасчетыСКлиентами.Ресурсы.КОтгрузке.Представление(),
	Метаданные.РегистрыНакопления.РасчетыСКлиентами.Ресурсы.КОплате.Представление());
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Справочники.ДоговорыКонтрагентов.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ВзаимозачетЗадолженности.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя());
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя());
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
КонецПроцедуры

// Процедура регистрации данных для обработчика обновления ОбработатьДанныеДляПереходаНаВерсию.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра  = "РегистрНакопления.РасчетыСКлиентами";

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСКлиентами.Регистратор КАК Регистратор,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетовНакладная
	|ПОМЕСТИТЬ ВтОбъектыРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (РасчетыСКлиентами.Регистратор = ОбъектыРасчетов.Объект)
	|ГДЕ
	|	РасчетыСКлиентами.Сумма <> 0
	|	И НЕ РасчетыСКлиентами.ПродажаПоЗаказу В (&ПустыеСсылкиНаЗаказы)
	|	И РасчетыСКлиентами.ПродажаПоЗаказу.ПорядокРасчетов В(&ПорядкиРасчетов)
	|	И НЕ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	ОбъектРасчетовНакладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Очистка ресурса "Оплачивается"
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.Оплачивается <> 0
	|	И (Расчеты.ЗаявкаНаРасходованиеДенежныхСредств В (
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ДанныеРасшифровки.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ДанныеРасшифровки
	|		ГДЕ
	|			ДанныеРасшифровки.ОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|			И ДанныеРасшифровки.ОбъектРасчетов.Объект = Неопределено)
	|		ИЛИ НЕ Расчеты.ЗаявкаНаРасходованиеДенежныхСредств.КонтролироватьОплатуПоОбъектамРасчетов)
	|
	// Перезаполнение поля ПорядокЗачетаПоДатеПлатежа
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.Сумма > 0
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Расчеты.ДатаПлатежа <> ДАТАВРЕМЯ(1,1,1)
	|	И НАЧАЛОПЕРИОДА(Расчеты.ДатаПлатежа,ДЕНЬ) <> НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора,ДЕНЬ)
	|	И Расчеты.ПорядокОперации = Расчеты.ПорядокЗачетаПоДатеПлатежа
	|	И Расчеты.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами)
	//Исправление порядка операции "КОтгрузке"
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.КОтгрузке <> 0
	|	И НАЧАЛОПЕРИОДА(Расчеты.Период, ДЕНЬ) <> НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора, ДЕНЬ)
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, 0, 8) <> ПОДСТРОКА(Расчеты.ПорядокЗачетаПоДатеПлатежа, 0, 8)
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (ТИП(Документ.ЗаказКлиента),
	|										ТИП(Документ.ЗаявкаНаВозвратТоваровОтКлиента))
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПриемники.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыПриемники
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК НеПустыеПриемники
	|	ПО РасчетыПриемники.Регистратор = НеПустыеПриемники.Регистратор
	|		И НеПустыеПриемники.ОбъектРасчетовПриемник <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|		И НеПустыеПриемники.АналитикаУчетаПоПартнерамПриемник <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|		И НеПустыеПриемники.ВалютаПриемник <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		И НеПустыеПриемники.СуммаПриемник <> 0
	|ГДЕ
	|	НеПустыеПриемники.Регистратор ЕСТЬ NULL
	|	И РасчетыПриемники.ПоДаннымОбъектаРасчетовИсточника
	|	И ТИПЗНАЧЕНИЯ(РасчетыПриемники.Регистратор) <> ТИП(Документ.ВзаимозачетЗадолженности)
	|
	// Исправление остатков К оплате
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВтОбъектыРасчетов.Регистратор КАК Регистратор
	|ИЗ
	|	ВтОбъектыРасчетов КАК ВтОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Обороты(
	|				,
	|				,
	|				Регистратор,
	|				ОбъектРасчетов В
	|					(ВЫБРАТЬ
	|						Т.ОбъектРасчетовНакладная
	|					ИЗ
	|						ВтОбъектыРасчетов КАК Т)) КАК РасчетыСКлиентамиОбороты
	|		ПО (ВтОбъектыРасчетов.Регистратор = РасчетыСКлиентамиОбороты.Регистратор)
	|			И (ВтОбъектыРасчетов.ОбъектРасчетовНакладная = РасчетыСКлиентамиОбороты.ОбъектРасчетов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОбъектыРасчетов.Регистратор
	|	
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиОбороты.СуммаОборот, 0)) <> СУММА(ЕСТЬNULL(РасчетыСКлиентамиОбороты.КОплатеОборот, 0)) 
	|
	// Исправление хозяйственной операции взаимозачета задолженности
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	Расчеты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|		И ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОпераций)
	|		И Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|
	// Заполнение флага ПоДаннымОбъектаРасчетовИсточника в расчетах по срокам
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПриемники.ДокументРегистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыИсточники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПриемники
	|	ПО РасчетыИсточники.ДокументРегистратор = РасчетыПриемники.ДокументРегистратор
	|		И РасчетыИсточники.ОбъектРасчетовПриемник = РасчетыПриемники.ОбъектРасчетов
	|		И РасчетыИсточники.АналитикаУчетаПоПартнерамПриемник = РасчетыПриемники.АналитикаУчетаПоПартнерам
	|		И РасчетыИсточники.ВалютаПриемник = РасчетыПриемники.Валюта
	|		И РасчетыИсточники.СуммаПриемник <> 0
	|ГДЕ
	|	НЕ РасчетыПриемники.ПоДаннымОбъектаРасчетовИсточника
	|	И РасчетыПриемники.КорОбъектРасчетов <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|";
	
	Запрос.УстановитьПараметр("ПустыеСсылкиНаЗаказы", ОперативныеВзаиморасчетыСервер.ПустыеСсылкиНаЗаказы());
	Запрос.УстановитьПараметр("ХозяйственнаяОперацияПередачаНаХранение", Перечисления.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи);
	МассивПорядковРасчетов = Новый Массив;
	МассивПорядковРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоДоговорамНакладным);
	МассивПорядковРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоЗаказамНакладным);
	Запрос.УстановитьПараметр("ПорядкиРасчетов", МассивПорядковРасчетов);
	Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций());
	
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
		Параметры, 
		Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор"),
		ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "РегистрНакопления.РасчетыСКлиентами";

	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбновляемыеДанные.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТДляОбработки
	|ИЗ
	|	&ОбновляемыеДанные КАК ОбновляемыеДанные
	|;
	|
	|ВЫБРАТЬ
	|	СсылкиДляОбработки.Регистратор КАК Регистратор,
	|	СсылкиДляОбработки.Регистратор.Номер КАК РегистраторНомер
	|ИЗ 
	|	ВТДляОбработки КАК СсылкиДляОбработки
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПриемники.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыПриемники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО РасчетыПриемники.Регистратор = СсылкиДляОбработки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК НеПустыеПриемники
	|	ПО РасчетыПриемники.Регистратор = НеПустыеПриемники.Регистратор
	|		И НеПустыеПриемники.ОбъектРасчетовПриемник <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|		И НеПустыеПриемники.АналитикаУчетаПоПартнерамПриемник <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|		И НеПустыеПриемники.ВалютаПриемник <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		И НеПустыеПриемники.СуммаПриемник <> 0
	|ГДЕ
	|	НеПустыеПриемники.Регистратор ЕСТЬ NULL
	|	И РасчетыПриемники.ПоДаннымОбъектаРасчетовИсточника
	|	И ТИПЗНАЧЕНИЯ(РасчетыПриемники.Регистратор) <> ТИП(Документ.ВзаимозачетЗадолженности)
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСКлиентами.Регистратор КАК Регистратор,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетовНакладная
	|ПОМЕСТИТЬ ВтОбъектыРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (РасчетыСКлиентами.Регистратор = ОбъектыРасчетов.Объект)
	|ГДЕ
	|	РасчетыСКлиентами.Сумма <> 0
	|	И НЕ РасчетыСКлиентами.ПродажаПоЗаказу В (&ПустыеСсылкиНаЗаказы)
	|	И РасчетыСКлиентами.ПродажаПоЗаказу.ПорядокРасчетов В(&ПорядкиРасчетов)
	|	И НЕ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	ОбъектРасчетовНакладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОбъектыРасчетов.Регистратор КАК Ссылка
	|ИЗ
	|	ВтОбъектыРасчетов КАК ВтОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами.Обороты(
	|				,
	|				,
	|				Регистратор,
	|				ОбъектРасчетов В
	|					(ВЫБРАТЬ
	|						Т.ОбъектРасчетовНакладная
	|					ИЗ
	|						ВтОбъектыРасчетов КАК Т)) КАК РасчетыСКлиентамиОбороты
	|		ПО (ВтОбъектыРасчетов.Регистратор = РасчетыСКлиентамиОбороты.Регистратор)
	|			И (ВтОбъектыРасчетов.ОбъектРасчетовНакладная = РасчетыСКлиентамиОбороты.ОбъектРасчетов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОбъектыРасчетов.Регистратор
	|	
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(РасчетыСКлиентамиОбороты.СуммаОборот, 0)) <> СУММА(ЕСТЬNULL(РасчетыСКлиентамиОбороты.КОплатеОборот, 0)) 
	|;
	|
	// Исправление хозяйственных операций
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО Расчеты.Регистратор = СсылкиДляОбработки.Регистратор
	|ГДЕ
	|	ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОперацийПоДолгу)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО Расчеты.Регистратор = СсылкиДляОбработки.Регистратор
	|ГДЕ
	|	ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОперацийПоАвансу)
	|;
	|
	// Заполнение флага ПоДаннымОбъектаРасчетовИсточника в расчетах по срокам
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПриемники.ДокументРегистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыИсточники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО РасчетыИсточники.ДокументРегистратор = СсылкиДляОбработки.Регистратор
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПриемники
	|	ПО РасчетыИсточники.ДокументРегистратор = РасчетыПриемники.ДокументРегистратор
	|		И РасчетыИсточники.ОбъектРасчетовПриемник = РасчетыПриемники.ОбъектРасчетов
	|		И РасчетыИсточники.АналитикаУчетаПоПартнерамПриемник = РасчетыПриемники.АналитикаУчетаПоПартнерам
	|		И РасчетыИсточники.ВалютаПриемник = РасчетыПриемники.Валюта
	|		И РасчетыИсточники.СуммаПриемник <> 0
	|ГДЕ
	|	НЕ РасчетыПриемники.ПоДаннымОбъектаРасчетовИсточника
	|;";
	
	Запрос.УстановитьПараметр("ОбновляемыеДанные", ОбновляемыеДанные);
	Запрос.УстановитьПараметр("ПустыеСсылкиНаЗаказы", ОперативныеВзаиморасчетыСервер.ПустыеСсылкиНаЗаказы());
	МассивПорядковРасчетов = Новый Массив;
	МассивПорядковРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоДоговорамНакладным);
	МассивПорядковРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоЗаказамНакладным);
	Запрос.УстановитьПараметр("ПорядкиРасчетов", МассивПорядковРасчетов);
	Запрос.УстановитьПараметр("ВидыОперацийПоДолгу", ВидыОперацийПоДолгу());
	Запрос.УстановитьПараметр("ВидыОперацийПоАвансу", ВидыОперацийПоАвансу());
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ОбновляемыеДанные =  РезультатыЗапроса[1].Выбрать();
	ОчисткаФлагаПоДаннымИсточника = РезультатыЗапроса[2].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ИсправлениеОстатковКОплате = РезультатыЗапроса[4].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ВзаимозачетПереносДолга = РезультатыЗапроса[5].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ВзаимозачетПереносАванса = РезультатыЗапроса[6].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ЗаполнениеФлагаВРасчетахПоСрокам = РезультатыЗапроса[7].Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ДанныеЗаменыОперации = ДанныеЗаменыОперации();
	НоваяАрхитектураВзаиморасчетов = ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
	ЗапросВспомогательныхДанных = ЗапросВспомогательныхДанных(Истина);
	
	Пока ОбновляемыеДанные.Следующий() Цикл
		
		ПроблемныйРегистратор = ОбновляемыеДанные.Регистратор;
		
		Если НоваяАрхитектураВзаиморасчетов Тогда
			ЗапросВспомогательныхДанных.УстановитьПараметр("Ссылка", ПроблемныйРегистратор);
			ВспомогательныеДанные = ЗапросВспомогательныхДанных.ВыполнитьПакет();
			РегистраторыРасчетов = ВспомогательныеДанные[0].Выгрузить();
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			#Область Блокировки
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСКлиентами.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", ПроблемныйРегистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Если НоваяАрхитектураВзаиморасчетов Тогда
				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСКлиентамиПоСрокам.НаборЗаписей");
				ЭлементБлокировки.ИсточникДанных = РегистраторыРасчетов;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				
				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщикамиПоСрокам.НаборЗаписей");
				ЭлементБлокировки.ИсточникДанных = РегистраторыРасчетов;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			КонецЕсли;
			
			Блокировка.Заблокировать();
			#КонецОбласти
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ПроблемныйРегистратор);
			НаборЗаписей.Прочитать();
			ДвиженияДоИзменения = НаборЗаписей.Выгрузить();

			#Область ЗаполнениеФлагаПоДаннымИсточникаВРасчетахПоСрокам
			Если ЗаполнениеФлагаВРасчетахПоСрокам.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				ЗаполнитьФлагВРасчетахПоСрокам(НаборЗаписей, ВспомогательныеДанные, РегистраторыРасчетов);
			КонецЕсли;
			#КонецОбласти
			
			Если ОчисткаФлагаПоДаннымИсточника.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				Для Каждого Запись Из НаборЗаписей Цикл
					Запись.ПоДаннымОбъектаРасчетовИсточника = Ложь;
				КонецЦикла;
			КонецЕсли;

			ЕстьЗаявкиНаРасходованиеДенежныхСредств = Ложь;
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход
					И Запись.КОплате > 0 
					И НачалоДня(Запись.Период) < НачалоДня(Запись.ДатаРегистратора) 
					И НЕ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ВводОстатков")
					И НЕ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов") Тогда
					Запись.Период = Запись.ДатаРегистратора;
				КонецЕсли;
				Если ЗначениеЗаполнено(Запись.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
					ЕстьЗаявкиНаРасходованиеДенежныхСредств = Истина;
				КонецЕсли;
			КонецЦикла;
			
			//Очистка ресурса "Оплачивается"
			Если ЕстьЗаявкиНаРасходованиеДенежныхСредств Тогда
				ЗаявкиНаРасходованиеДенежныхСредств = НаборЗаписей.ВыгрузитьКолонку("ЗаявкаНаРасходованиеДенежныхСредств");
				РеквизитыЗаявок = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ЗаявкиНаРасходованиеДенежныхСредств,"КонтролироватьОплатуПоОбъектамРасчетов");
				Для Каждого Запись Из НаборЗаписей Цикл
					Если ЗначениеЗаполнено(Запись.ЗаявкаНаРасходованиеДенежныхСредств)
						И Запись.Оплачивается <> 0 
						И НЕ РеквизитыЗаявок[Запись.ЗаявкаНаРасходованиеДенежныхСредств] Тогда
						Запись.Оплачивается = 0;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			//Перезаполнение поля ПорядокЗачетаПоДатеПлатежа
			ТипДокумента = ТипЗнч(Запись.Регистратор);
			Тип = ОперативныеВзаиморасчетыСервер.НомерТипа(ТипДокумента);
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.ВидДвижения = ВидДвиженияНакопления.Расход
					И Запись.Сумма > 0 
					И ЗначениеЗаполнено(Запись.ДатаПлатежа)
					И НачалоДня(Запись.ДатаПлатежа) <> НачалоДня(Запись.ДатаРегистратора) 
					И Запись.ПорядокОперации = Запись.ПорядокЗачетаПоДатеПлатежа 
					И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами Тогда
					Запись.ПорядокЗачетаПоДатеПлатежа = ОперативныеВзаиморасчетыСервер.Порядок(Запись.ДатаПлатежа, 
						ОбновляемыеДанные.РегистраторНомер, ТипДокумента, Сред(Запись.ПорядокОперации,9,1), Тип);
				КонецЕсли;
			КонецЦикла;
			#Область ИсправлениеПорядкаОперации
			Если ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ЗаказКлиента")
				
				ИЛИ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
				НомерДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроблемныйРегистратор, "Номер");
				Для Каждого Запись Из НаборЗаписей Цикл
					Если Запись.КОтгрузке <> 0 Тогда
						Запись.ПорядокОперации = ОперативныеВзаиморасчетыСервер.Порядок(
							Запись.ДатаРегистратора,
							НомерДокумента,
							ТипЗнч(Запись.Регистратор),
							1);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			#КонецОбласти
			
			#Область ИсправлениеОстатковКОплате
			
			Если ИсправлениеОстатковКОплате.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				
				ДанныеДляПроведения = ПроведениеДокументов.ДанныеДокументаДляПроведения(ПроблемныйРегистратор, "РасчетыСКлиентами");
				НовыеДвижения = ДанныеДляПроведения.ТаблицаРасчетыСКлиентами;
				ВзаиморасчетыСервер.ДобавитьЗаполнитьПорядокРасчетовСКлиентами(НовыеДвижения, ТипЗнч(ПроблемныйРегистратор));
				
				КолонкиИзмерений = "АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта,ВидДвижения";
				// Для контроля неизменности движений по ресурсам, кроме КОплате
				КолонкиРесурсов = "Сумма,Оплачивается,КОтгрузке,Отгружается";
				ТаблицаДвижений = НаборЗаписей.Выгрузить();
				
				СтарыеДвижения = ТаблицаДвижений.Скопировать(,КолонкиИзмерений+","+КолонкиРесурсов);
				СтарыеДвижения.Свернуть(КолонкиИзмерений, КолонкиРесурсов);
				СтарыеДвижения.Сортировать(КолонкиИзмерений+","+КолонкиРесурсов);
				Индекс = СтарыеДвижения.Количество();
				Пока Индекс > 0 Цикл
					Индекс = Индекс - 1;
					Если СтарыеДвижения[Индекс].Сумма = 0
						И СтарыеДвижения[Индекс].Оплачивается = 0
						И СтарыеДвижения[Индекс].КОтгрузке = 0
						И СтарыеДвижения[Индекс].Отгружается = 0 Тогда
						СтарыеДвижения.Удалить(Индекс);
					КонецЕсли;
				КонецЦикла;
				
				ИдентификаторФинЗаписиКОплате = "";
				ЕстьИзменения = Ложь;
				Индекс = ТаблицаДвижений.Количество();
				Пока Индекс > 0 Цикл
					Индекс = Индекс - 1;
					Если ТаблицаДвижений[Индекс].КОплате <> 0 Тогда
						ТаблицаДвижений[Индекс].КОплате = 0;
						Если ТаблицаДвижений[Индекс].ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносАванса Тогда
							ИдентификаторФинЗаписиКОплате = ТаблицаДвижений[Индекс].ИдентификаторФинЗаписи;
						КонецЕсли;
						Если ТаблицаДвижений[Индекс].Сумма = 0
							И ТаблицаДвижений[Индекс].Оплачивается = 0
							И ТаблицаДвижений[Индекс].КОтгрузке = 0
							И ТаблицаДвижений[Индекс].Отгружается = 0 Тогда
							ТаблицаДвижений.Удалить(Индекс);
						КонецЕсли;
						ЕстьИзменения = Истина;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого СтрокаКОплате Из НовыеДвижения Цикл
					Если СтрокаКОплате.КОплате <> 0 Тогда
						ЕстьИзменения = Истина;
						НоваяЗапись = ТаблицаДвижений.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаКОплате);
						НоваяЗапись.Сумма = 0;
						НоваяЗапись.СуммаУпр = 0;
						НоваяЗапись.СуммаРегл = 0;
						НоваяЗапись.ИдентификаторФинЗаписи = "";
						НоваяЗапись.Оплачивается = 0;
						НоваяЗапись.КОтгрузке = 0;
						НоваяЗапись.Отгружается = 0;
						НоваяЗапись.Регистратор = ПроблемныйРегистратор;
						НоваяЗапись.Активность = Истина;
					КонецЕсли;
				КонецЦикла;
					
				НовыеДвижения = ТаблицаДвижений.Скопировать(,КолонкиИзмерений+","+КолонкиРесурсов);
				НовыеДвижения.Свернуть(КолонкиИзмерений, КолонкиРесурсов);
				НовыеДвижения.Сортировать(КолонкиИзмерений+","+КолонкиРесурсов);
				Индекс = НовыеДвижения.Количество();
				Пока Индекс > 0 Цикл
					Индекс = Индекс - 1;
					Если НовыеДвижения[Индекс].Сумма = 0
						И НовыеДвижения[Индекс].Оплачивается = 0
						И НовыеДвижения[Индекс].КОтгрузке = 0
						И НовыеДвижения[Индекс].Отгружается = 0 Тогда
						НовыеДвижения.Удалить(Индекс);
					КонецЕсли;
				КонецЦикла;
				
				Если ЕстьИзменения И ТаблицыРавны(СтарыеДвижения, НовыеДвижения) Тогда
					
					ЗапросСвертки = Новый Запрос;
					ЗапросСвертки.Текст = 
					"ВЫБРАТЬ
					|	&ВсеПоля
					|ПОМЕСТИТЬ ВтДвижения
					|ИЗ
					|	&ТаблицаДвижений КАК ТаблицаДвижений
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	&ПоляГруппировки,
					|	&ПоляРесурсов
					|ИЗ
					|	ВтДвижения КАК Т
					|СГРУППИРОВАТЬ ПО
					|	&ПоляГруппировки";
					ЗапросСвертки.УстановитьПараметр("ТаблицаДвижений", ТаблицаДвижений);
					КолонкиДляГруппировки = Новый Массив;
					ВсеКолонки = Новый Массив;
					КолонкиРесурсов = КолонкиРесурсов + ",КОплате";
					Для Каждого Колонка Из ТаблицаДвижений.Колонки Цикл
						Если СтрНайти(КолонкиРесурсов, Колонка.Имя) = 0 
							И Колонка.Имя <> "СуммаУпр"
							И Колонка.Имя <> "СуммаРегл"
							И Колонка.Имя <> "ИдентификаторФинЗаписи"
							И Колонка.Имя <> "НомерСтроки"
							И Колонка.Имя <> "МоментВремени" Тогда
							КолонкиДляГруппировки.Добавить(Колонка.Имя);
						КонецЕсли;
						Если Колонка.Имя <> "МоментВремени" Тогда
							ВсеКолонки.Добавить(Колонка.Имя);
						КонецЕсли;
					КонецЦикла;
					КолонкиДляСуммирования = СтрРазделить(КолонкиРесурсов, ",");
					Индекс = 0;
					Пока Индекс < КолонкиДляСуммирования.Количество() Цикл
						КолонкиДляСуммирования[Индекс] = СтрШаблон("СУММА(%1) КАК %1", КолонкиДляСуммирования[Индекс]);
						Индекс = Индекс + 1;
					КонецЦикла;
					КолонкиДляСуммирования.Добавить("СУММА(СуммаУпр) КАК СуммаУпр");
					КолонкиДляСуммирования.Добавить("СУММА(СуммаРегл) КАК СуммаРегл");
					КолонкиДляСуммирования.Добавить("МАКСИМУМ(ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи");
					КолонкиДляСуммирования.Добавить("МАКСИМУМ(НомерСтроки) КАК НомерСтроки");
					ЗапросСвертки.Текст = СтрЗаменить(ЗапросСвертки.Текст, "&ПоляГруппировки", СтрСоединить(КолонкиДляГруппировки,","));
					ЗапросСвертки.Текст = СтрЗаменить(ЗапросСвертки.Текст, "&ВсеПоля", СтрСоединить(ВсеКолонки,","));
					ЗапросСвертки.Текст = СтрЗаменить(ЗапросСвертки.Текст, "&ПоляРесурсов", СтрСоединить(КолонкиДляСуммирования,","));
					
					ТаблицаДвижений = ЗапросСвертки.Выполнить().Выгрузить();
					Для Каждого СтрокаДвижения Из ТаблицаДвижений Цикл
						Если СтрокаДвижения.КОплате <> 0 
							И СтрокаДвижения.Сумма = 0
							И Не ЗначениеЗаполнено(СтрокаДвижения.ИдентификаторФинЗаписи) Тогда
							СтрокаДвижения.ИдентификаторФинЗаписи = ИдентификаторФинЗаписиКОплате;
						КонецЕсли;
					КонецЦикла;
					НаборЗаписей.Загрузить(ТаблицаДвижений);
					
				Иначе
					
					ТекстСообщения = СтрШаблон(НСтр("ru = 'При выполнении обработчика обновления регистра накопления ""%1"" 
							|по исправлению остатков ""%2"" изменились итоги остальных ресурсов в движениях документа 
							|%3, обработка документа не выполнена'"),
						Метаданные.РегистрыНакопления.РасчетыСКлиентами.Представление(),
						Метаданные.РегистрыНакопления.РасчетыСКлиентами.Ресурсы.КОплате.Представление(),
						ПроблемныйРегистратор);
					ЗаписьЖурналаРегистрации(
						ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
						УровеньЖурналаРегистрации.Ошибка,
						Метаданные.РегистрыНакопления.РасчетыСКлиентами, ,
						ТекстСообщения);
					
				КонецЕсли;
				
			КонецЕсли;
			
			#КонецОбласти
			
			#Область ИсправлениеХозяйственнойОперацииВзаимозачета
			Если ВзаимозачетПереносДолга.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				ЗаменитьХозяйственнуюОперацию(ДанныеЗаменыОперации, НаборЗаписей, Истина);
			ИначеЕсли ВзаимозачетПереносАванса.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				ЗаменитьХозяйственнуюОперацию(ДанныеЗаменыОперации, НаборЗаписей, Ложь);
			КонецЕсли;
			#КонецОбласти
			
			ИзменилисьИтоги = Ложь;
			Если НаборЗаписей.Количество() > 0 Тогда
				ИзменилисьИтоги = ЕстьИзмененияИтоговНабора(НаборЗаписей, ДвиженияДоИзменения);
			КонецЕсли;
			Если НаборЗаписей.Модифицированность() И НЕ ИзменилисьИтоги Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ПроблемныйРегистратор);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Функция ТаблицыРавны(Таблица1, Таблица2)
	
	МассивКолонок = Новый Массив;
	Для Каждого Колонка Из Таблица1.Колонки Цикл
		МассивКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Результат = Истина;
	Если Таблица1.Количество() <> Таблица2.Количество() Тогда
		Результат = Ложь;
	КонецЕсли;
	Если Результат Тогда
		Для Счетчик = 0 По Таблица1.Количество() - 1 Цикл
			Если Не ОбщегоНазначенияУТКлиентСервер.СтруктурыРавны(
						Таблица1[Счетчик],
						Таблица2[Счетчик],
						МассивКолонок) Тогда
				Результат = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	Возврат Результат;
	
КонецФункции

#Область ИсправлениеХозяйстеннойОперации

Функция ДанныеЗаменыОперации() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ОперацияПереносДолга", Перечисления.ХозяйственныеОперации.ПереносДолга);
	Результат.Вставить("ОперацияПереносАванса", Перечисления.ХозяйственныеОперации.ПереносАванса);
	Результат.Вставить("ОперацияВзаимозачет", Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности);
	Результат.Вставить("НастройкаПереносДолга", Справочники.НастройкиХозяйственныхОпераций.ПереносДолга);
	Результат.Вставить("НастройкаПереносАванса", Справочники.НастройкиХозяйственныхОпераций.ПереносАванса);
	Результат.Вставить("НастройкаВзаимозачет", Справочники.НастройкиХозяйственныхОпераций.ВзаимозачетЗадолженности);
	Результат.Вставить("ВидыОперацийПоДолгу", ВидыОперацийПоДолгу());
	Результат.Вставить("ВидыОперацийПоАвансу", ВидыОперацийПоАвансу());
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаменитьХозяйственнуюОперацию(ДанныеЗамены, НаборЗаписей, ЭтоПереносДолга) Экспорт
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись.ХозяйственнаяОперация = ДанныеЗамены.ОперацияВзаимозачет Тогда
			Если ЭтоПереносДолга Тогда
				Запись.ХозяйственнаяОперация = ДанныеЗамены.ОперацияПереносДолга;
				Запись.НастройкаХозяйственнойОперации = ДанныеЗамены.НастройкаПереносДолга;
			Иначе
				Запись.ХозяйственнаяОперация = ДанныеЗамены.ОперацияПереносАванса;
				Запись.НастройкаХозяйственнойОперации = ДанныеЗамены.НастройкаПереносАванса;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ВидыОпераций() Экспорт
	
	Результат = ВидыОперацийПоДолгу();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ВидыОперацийПоАвансу());
	Возврат Результат;
	
КонецФункции

Функция ВидыОперацийПоДолгу() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаКлиентаОрганизацияКонтрагент);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаКлиентаМеждуКонтрагентами);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаКлиентаМеждуОрганизациями);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаПоставщикуОрганизацияКонтрагент);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаПоставщикуМеждуКонтрагентами);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносДолгаПоставщикуМеждуОрганизациями);
	
	Возврат Массив;
	
КонецФункции

Функция ВидыОперацийПоАвансу() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаКлиентаОрганизацияКонтрагент);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаКлиентаМеждуКонтрагентами);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаКлиентаМеждуОрганизациями);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаПоставщикуОрганизацияКонтрагент);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаПоставщикуМеждуКонтрагентами);
	Массив.Добавить(Перечисления.ВидыОперацийВзаимозачетаЗадолженности.ПереносАвансаПоставщикуМеждуОрганизациями);
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеФлагаВРасчетахПоСрокам

// Запрос вспомогательных данных.
// 
// Параметры:
//  ЭтоРасчетыСКлиентами - Булево - Это расчеты с клиентами.
//  ЗаполнитьФлагПоСрокам - Булево - Заполнение флага в расчетах по срокам.
// 
// Возвращаемое значение:
//  Запрос - Запрос вспомогательных данных
Функция ЗапросВспомогательныхДанных(ЭтоРасчетыСКлиентами) Экспорт
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(ТекстЗапросаРегистраторовДляЗаполненияФлага(ЭтоРасчетыСКлиентами));
	ТекстыЗапросов.Добавить(ТекстЗапросаПриемниковПоСрокам(ЭтоРасчетыСКлиентами));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтоРасчетыСКлиентами", ЭтоРасчетыСКлиентами);
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Возврат Запрос;
	
КонецФункции

Функция ТекстЗапросаРегистраторовДляЗаполненияФлага(ЭтоРасчетыСКлиентами)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПоСрокам.ДокументРегистратор КАК ДокументРегистратор,
	|	РасчетыПоСрокам.Регистратор КАК Регистратор,
	|	ИСТИНА КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
	|ГДЕ
	|	РасчетыПоСрокам.ДокументРегистратор = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПоСрокам.ДокументРегистратор КАК ДокументРегистратор,
	|	РасчетыПоСрокам.Регистратор КАК Регистратор,
	|	ЛОЖЬ КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокам
	|ГДЕ
	|	РасчетыПоСрокам.ДокументРегистратор = &Ссылка
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПриемниковПоСрокам(ЭтоРасчетыСКлиентами)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПриемники.Регистратор КАК Регистратор,
	|	РасчетыПриемники.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПриемники.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПриемники.Валюта КАК Валюта,
	|	РасчетыИсточники.СуммаПриемник КАК СуммаПриемник,
	|	РасчетыПриемники.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	&ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|	РасчетыИсточники.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерамИсточник,
	|	РасчетыИсточники.ОбъектРасчетов КАК ОбъектРасчетовИсточник,
	|	РасчетыИсточники.Валюта КАК ВалютаИсточник,
	|	РасчетыИсточники.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	РасчетыПриемники.ДокументРегистратор КАК ДокументРегистратор
	|ПОМЕСТИТЬ втРегистраторыПриемников
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыИсточники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПриемники
	|	ПО РасчетыИсточники.ДокументРегистратор = РасчетыПриемники.ДокументРегистратор
	|		И РасчетыИсточники.ОбъектРасчетовПриемник = РасчетыПриемники.ОбъектРасчетов
	|		И РасчетыИсточники.АналитикаУчетаПоПартнерамПриемник = РасчетыПриемники.АналитикаУчетаПоПартнерам
	|		И РасчетыИсточники.ВалютаПриемник = РасчетыПриемники.Валюта
	|		И РасчетыИсточники.ИдентификаторФинЗаписи = РасчетыПриемники.ИдентификаторФинЗаписи
	|		И РасчетыИсточники.СуммаПриемник <> 0
	|ГДЕ
	|	НЕ РасчетыПриемники.ПоДаннымОбъектаРасчетовИсточника
	|	И РасчетыПриемники.ДокументРегистратор = &Ссылка
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПриемники.Регистратор КАК Регистратор,
	|	РасчетыПриемники.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПриемники.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПриемники.Валюта КАК Валюта,
	|	РасчетыИсточники.СуммаПриемник КАК СуммаПриемник,
	|	РасчетыПриемники.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	НЕ &ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|	РасчетыИсточники.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерамИсточник,
	|	РасчетыИсточники.ОбъектРасчетов КАК ОбъектРасчетовИсточник,
	|	РасчетыИсточники.Валюта КАК ВалютаИсточник,
	|	РасчетыИсточники.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	РасчетыПриемники.ДокументРегистратор КАК ДокументРегистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыИсточники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПриемники
	|	ПО РасчетыИсточники.ДокументРегистратор = РасчетыПриемники.ДокументРегистратор
	|		И РасчетыИсточники.ОбъектРасчетовПриемник = РасчетыПриемники.ОбъектРасчетов
	|		И РасчетыИсточники.АналитикаУчетаПоПартнерамПриемник = РасчетыПриемники.АналитикаУчетаПоПартнерам
	|		И РасчетыИсточники.ВалютаПриемник = РасчетыПриемники.Валюта
	|		И РасчетыИсточники.ИдентификаторФинЗаписи = РасчетыПриемники.ИдентификаторФинЗаписи
	|		И РасчетыИсточники.СуммаПриемник <> 0
	|ГДЕ
	|	НЕ РасчетыПриемники.ПоДаннымОбъектаРасчетовИсточника
	|	И РасчетыПриемники.ДокументРегистратор = &Ссылка
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПриемники.Регистратор КАК Регистратор,
	|	РасчетыПриемники.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПриемники.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыПриемники.Валюта КАК Валюта,
	|	РасчетыПриемники.СуммаПриемник КАК Сумма,
	|	РасчетыПриемники.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	РасчетыПриемники.ЭтоРасчетыСКлиентами КАК ЭтоРасчетыСКлиентами,
	|	РасчетыПриемники.АналитикаУчетаПоПартнерамИсточник КАК АналитикаУчетаПоПартнерамИсточник,
	|	РасчетыПриемники.ОбъектРасчетовИсточник КАК ОбъектРасчетовИсточник,
	|	РасчетыПриемники.ВалютаИсточник КАК ВалютаИсточник,
	|	РасчетыПриемники.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	РасчетыПриемники.ДокументРегистратор КАК ДокументРегистратор
	|ИЗ
	|	втРегистраторыПриемников КАК РасчетыПриемники
	|ГДЕ
	|	РасчетыПриемники.ДокументРегистратор = &Ссылка
	|";
	
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.РасчетыСКлиентамиПоСрокам", "%1");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РегистрНакопления.РасчетыСПоставщикамиПоСрокам", "РегистрНакопления.РасчетыСКлиентамиПоСрокам");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%1", "РегистрНакопления.РасчетыСПоставщикамиПоСрокам");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Наборы регистраторов расчетов.
// 
// Параметры:
//  РегистраторыРасчетов - ТаблицаЗначений - Регистраторы расчетов
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - Наборы регистраторов расчетов:
//  * Ключ - ДокументСсылка - Регистратор набора.
//  * Значение - РегистрНакопленияНаборЗаписей.РасчетыСКлиентами,РегистрНакопленияНаборЗаписей.РасчетыСПоставщикамиПоСрокам 
//
Функция НаборыРегистраторовРасчетов(РегистраторыРасчетов) Экспорт
	
	Результат = Новый Соответствие;
	Для Каждого Запись Из РегистраторыРасчетов Цикл
		
		Если Запись.ЭтоРасчетыСКлиентами Тогда
			Набор = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
		Иначе
			Набор = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
		КонецЕсли;
		Набор.Отбор.Регистратор.Установить(Запись.Регистратор);
		Набор.Прочитать();
		ТаблицаНабора = Набор.Выгрузить();
		ТаблицаНабора.Индексы.Добавить(ПоляПоиска());
		Данные = Новый Структура("ЭтоРасчетыСКлиентами, Набор",Запись.ЭтоРасчетыСКлиентами,ТаблицаНабора);
		Результат.Вставить(Запись.Регистратор, Данные);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПоляПоиска()
	
	Возврат "ДокументРегистратор,АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта,СтатьяДвиженияДенежныхСредств,ИдентификаторФинЗаписи";
	
КонецФункции

Процедура ЗаписатьНаборыРегистраторов(НаборЗаписей, НаборыРегистраторовРасчетов)
	
	Для Каждого Описание Из НаборыРегистраторовРасчетов Цикл
		Если Описание.Значение.ЭтоРасчетыСКлиентами Тогда
			Набор = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
		Иначе
			Набор = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
		КонецЕсли;
		Набор.Отбор.Регистратор.Установить(Описание.Ключ);
		Набор.Загрузить(Описание.Значение.Набор);
		Набор.ОбменДанными.Загрузка = Истина;
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Заполнить флаг в расчетах по срокам.
// 
// Параметры:
//  ВспомогательныеДанные - Массив Из ТаблицаЗначений - 
//  РегистраторыРасчетов - Массив из ДокументСсылка - 
//
Процедура ЗаполнитьФлагВРасчетахПоСрокам(НаборЗаписей, ВспомогательныеДанные, РегистраторыРасчетов) Экспорт
	
	НаборыРегистраторовРасчетов = НаборыРегистраторовРасчетов(РегистраторыРасчетов);
	Приемники = ВспомогательныеДанные[2].Выгрузить();
	Для Каждого Приемник Из Приемники Цикл
		
		СведенияНабора = НаборыРегистраторовРасчетов[Приемник.Регистратор];
		Если СведенияНабора = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДанныеНабора = СведенияНабора.Набор;
		
		Отбор = Новый Структура(ПоляПоиска());
		ЗаполнитьЗначенияСвойств(Отбор, Приемник);
		НайденныеЗаписи = ДанныеНабора.НайтиСтроки(Отбор);
		Для Каждого Запись Из НайденныеЗаписи Цикл
			Если НЕ ЗначениеЗаполнено(Запись.ОбъектРасчетовПриемник)
					И НЕ ЗначениеЗаполнено(Запись.АналитикаУчетаПоПартнерамПриемник)
					И НЕ ЗначениеЗаполнено(Запись.ВалютаПриемник)
					И Запись.СуммаПриемник = 0 Тогда
				Запись.КорАналитикаУчетаПоПартнерам = Приемник.АналитикаУчетаПоПартнерамИсточник;
				Запись.КорОбъектРасчетов = Приемник.ОбъектРасчетовИсточник;
				Запись.ПоДаннымОбъектаРасчетовИсточника = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	//очистим кор.часть там где флаг ложь
	Для Каждого Набор Из НаборыРегистраторовРасчетов Цикл
		Для Каждого Запись Из Набор.Значение.Набор Цикл
			Если НЕ Запись.ПоДаннымОбъектаРасчетовИсточника
					И НЕ ЗначениеЗаполнено(Запись.ОбъектРасчетовПриемник)
					И НЕ ЗначениеЗаполнено(Запись.АналитикаУчетаПоПартнерамПриемник)
					И НЕ ЗначениеЗаполнено(Запись.ВалютаПриемник)
					И Запись.СуммаПриемник = 0 Тогда
				Запись.КорАналитикаУчетаПоПартнерам = Неопределено;
				Запись.КорОбъектРасчетов = Неопределено;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗаписатьНаборыРегистраторов(НаборЗаписей, НаборыРегистраторовРасчетов);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
